#Найдите сумму цифр трехзначного числа.

#a = int(input('Введите число: '))
#sum = 0
#for i in str(a):
#    sum += int(i)
#print(f'Сумма: {sum}')

#Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый
#ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
#а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

#a = int (input('Сколько дети сделали вместе: '))
#K = a // 2
#P = K // 2
#S = P
#print (K, P, S)





